reddit_on_rails/reddit_on_rails/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "7VaxiwoWu2ARke8qcfJxkw"], ["updated_at", "2018-11-20 20:07:18.353548"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64(16)
    self.save!