reddit_on_rails/reddit_on_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_id = params[:sub_id]
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "URL "], ["url", "www.google.com"], ["content", "google"], ["sub_id", 1], ["author_id", 1], ["created_at", "2018-11-20 22:32:53.761399"], ["updated_at", "2018-11-20 22:32:53.761399"]]