reddit_on_rails/reddit_on_rails/app/controllers/subs_controller.rb

  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update_attributes(sub_params)
---
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "something else tho"], ["updated_at", "2018-11-20 21:47:07.523398"], ["id", 2]]